run/fsiFoam/3dTube/fluid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fsiFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.002;

deltaT          1e-4;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.2;

functions
(
   pointHistory
   {
       type pointHistory;
       functionObjectLibs
       (
         "libpointHistory.so"
       );

       region solid;

       refHistoryPoint (0 0.005 0.025);
   }
);

// ************************************************************************* //
